Repository: dvarrazzo/postgresql-it
Catalog: pg_ctl-*.po
Languages: it

source: could not identify current directory: %s
it: impossibile identificare la directory corrente: %s

source: invalid binary "%s"
it: binario non valido "%s"

source: could not read binary "%s"
it: impossibile leggere il binario "%s"

source: could not find a "%s" to execute
it: impossibile trovare un "%s" da eseguire

source: could not change directory to "%s"
it: impossibile cambiare directory in "%s"

source: could not read symbolic link "%s"
it: impossibile leggere il link simbolico "%s"

source: child process exited with exit code %d
it: il processo figlio e' uscito con l'exit code %d

source: child process was terminated by exception 0x%X
it: il processo figlio e' stato terminato dall'eccezione 0x%X

source: child process was terminated by signal %s
it: il processo figlio terminato dal segnale %s

source: child process was terminated by signal %d
it: il processo figlio e' stato terminato dal segnale %d

source: child process exited with unrecognized status %d
it: il processo figlio e' uscito con uno stato non riconosciuto %d

source: %s: out of memory
it: %s: memoria esaurita

source: %s: could not open PID file "%s": %s
it: %s: non è possibile aprire il PID file "%s": %s

source: %s: invalid data in PID file "%s"
it: %s: dati non validi nel PID file "%s"

source: %s: cannot set core file size limit; disallowed by hard limit
it: %s: non è possibile configurare il limite di grandezza del core file; impedito dall' hard limit

source: %s: could not read file "%s"
it: %s: non è possibile leggere il file "%s"

source: %s: option file "%s" must have exactly one line
it: %s: il file opzionale file "%s" deve avere esattamente una linea

source: %s: database system initialization failed
it: %s: inizializzazione del sistema di database fallita

source: %s: another server might be running; trying to start server anyway
it: %s: un altro server potrebbe essere in esecuzione; si sta provando ad avviare il server ugualmente

source: %s: could not start server: exit code was %d
it: %s: non è possibile avviare il server: il segnale d'uscita è %d

source: waiting for server to start...
it: attendere che il server si avvii...

source: done
it: fatto

source: server started
it: il server è avviato

source: %s: could not start server Examine the log output.
it: %s: non è possibile avviareil serverr esaminare il log di output.

source: failed
it: fallito

source: server starting
it: il server si sta avviando

source: %s: PID file "%s" does not exist
it: %s: il PID file "%s" non esiste

source: Is server running?
it: il server è in esecuzione?

source: %s: cannot stop server; single-user server is running (PID: %ld)
it: %s: non è possibile fermare il server; il server è in esecuzione in modalità a singolo utente (PID: %ld)

source: %s: could not send stop signal (PID: %ld): %s
it: %s: non è possibile mandare il segnale di stop (PID: %ld): %s

source: server shutting down
it: il server è in spegnimento

source: WARNING: online backup mode is active Shutdown will not complete until pg_stop_backup() is called.
it: ATTENZIONE: è attivo l'online backup mode Lo spegnimento non sarà completato finchè non sarà chiamata pg_stop_backup().

source: waiting for server to shut down...
it: attendere lo spegnimento del server....

source: %s: server does not shut down
it: %s: il server non si sta spegnendo

source: server stopped
it: il server è stato terminato

source: starting server anyway
it: il server si sta avviando comunque

source: %s: cannot restart server; single-user server is running (PID: %ld)
it: %s: non è possibile riavviare il server; il server è in esecuzione in modalità a singlolo utente (PID: %ld)

source: Please terminate the single-user server and try again.
it: Si prega di terminare il server in modalità singolo utente e di riprovare

source: %s: old server process (PID: %ld) seems to be gone
it: %s: il vecchio processo del server (PID: %ld) sembra non essere più attivo

source: %s: cannot reload server; single-user server is running (PID: %ld)
it: %s: non è possibile eseguire il reload del server; il server è in esecuzione in modalità a singolo utente (PID: %ld)

source: %s: could not send reload signal (PID: %ld): %s
it: %s: non è possibile mandare il segnale di reload(PID: %ld): %s

source: server signaled
it: il server è segnalato

source: %s: single-user server is running (PID: %ld)
it: %s: il server è in esecuzione in modalità a singolo utente (PID: %ld)

source: %s: server is running (PID: %ld)
it: %s: il server è in esecuzione (PID: %ld)

source: %s: no server running
it: %s: il server non è in esecuzione

source: %s: could not send signal %d (PID: %ld): %s
it: %s: non è possibile mandare il segnale %d (PID: %ld): %s

source: %s: could not find own program executable
it: %s: non si sta trovando il proprio programma eseguibile

source: %s: could not find postgres program executable
it: %s: non è possibile trovare il programma eseguibile postgres

source: %s: could not open service manager
it: %s: non è possibile aprire il service manager

source: %s: service "%s" already registered
it: %s: il servizio "%s" è già registrato

source: %s: service "%s" not registered
it: %s: il servizio "%s" non è registrato

source: Waiting for server startup...
it: Attendere il server si sta avviando...

source: Timed out waiting for server startup
it: il tempo di attesa per l'avvio del server è scaduto

source: Server started and accepting connections
it: Il server è avviato e accetta connessioni

source: Try "%s --help" for more information.
it: Prova "%s --help" per avere più informazioni.

source: Usage:
it: Utilizzo:

source: Common options:
it: Opzioni comuni:

source: -s, --silent only print errors, no informational messages
it: -s, --silent mostra solo gli errori, non i messaggi di informazione

source: -w wait until operation completes
it: -w aspetta finchè l'opeazione non sia stata completata

source: -W do not wait until operation completes
it: -W non aspettare finchè l'operazione non è terminata

source: (The default is to wait for shutdown, but not for start or restart.)
it: (Il comportameeto di default è di aspettare lo spegnimento, ma non nel caso di avvio o riavvio.)

source: If the -D option is omitted, the environment variable PGDATA is used.
it: se l'opzione -D è omessa, la variabile d'ambiente PGDATA viene usata.

source: Options for start or restart:
it: Opzioni per l'avvio od il riavvio:

source: -c, --core-files allow postgres to produce core files
it: -c, --core-files permette a postgres di produrre core files

source: -c, --core-files not applicable on this platform
it: -c, --core-files non applicabile su questa piattaforma

source: -p PATH-TO-POSTGRES normally not necessary
it: -p PATH-TO-POSTGRES normalmente non necessario

source: Options for stop or restart:
it: Opzioni per lo spegnimento od il riavvio:

source: Shutdown modes are:
it: I modi di spegnimento sono:

source: smart quit after all clients have disconnected
it: smart chiudere dopo che tutti i clients si sono disconessi

source: fast quit directly, with proper shutdown
it: fast spegni direttamente, con una corretta procedura di arresto

source: immediate quit without complete shutdown; will lead to recovery on restart
it: immediate chiudere senza terminare il server: ciò porterà ad un recupero dei dati al riavvio

source: Allowed signal names for kill:
it: Nomi permessi ai segnali per kill:

source: Options for register and unregister:
it: Opzioni per register e unregister:

source: -N SERVICENAME service name with which to register PostgreSQL server
it: -N SERVICENAME nome del servizio con cui ci si registra sul server PostgreSQL

source: -P PASSWORD password of account to register PostgreSQL server
it: -P PASSWORD password per l'account con cui ci si registra sul server PostgreSQL

source: -U USERNAME user name of account to register PostgreSQL server
it: -U USERNAME user name dell'account con cui ci si registra sul server PostgreSQL

source: Report bugs to <pgsql-bugs@postgresql.org>.
it: Segnalare bachi a <pgsql-bugs@postgresql.org>.

source: %s: unrecognized shutdown mode "%s"
it: %s: modalità di spegnimento non riconosciuta "%s"

source: %s: unrecognized signal name "%s"
it: %s: nome del segnale non riconosciuto "%s"

source: %s: cannot be run as root Please log in (using, e.g., "su") as the (unprivileged) user that will own the server process.
it: %s: non puo' essere eseguito da root Effettuate il log in (usando per esempio "su") con l'utente (non privilegiato) che controllera' il processo server.

source: %s: too many command-line arguments (first is "%s")
it: %s: troppi parametri dalla riga di comando (il primo è "%s")

source: %s: missing arguments for kill mode
it: %s: mancano argomenti per la modalità di kill

source: %s: unrecognized operation mode "%s"
it: %s: modalità di operazione sconosciuta "%s"

source: %s: no operation specified
it: %s: nessuna operazione specificata

source: %s: no database directory specified and environment variable PGDATA unset
it: %s: nessuna directory del database è stata specificata e la variabile d'ambiente PGDATA non è configurata
