Repository: dvarrazzo/postgresql-it
Catalog: 9.2/plpython-*.po
Languages: it

source: could not execute plan
it: impossibile eseguire il piano

source: Expected sequence of %d argument, got %d: %s
it: Sequenza attesa per l'argomento %d, ricevuto %d: %s

source: unsupported set function return mode
it: modalità di ritorno della funzione set non supportata

source: PL/Python set-returning functions only support returning only value per call.
it: le funzioni set-returning di PL/Python supportano il valore di ritorno solo una volta per chiamata

source: returned object cannot be iterated
it: l'oggetto ritornato non può essere iterato

source: PL/Python set-returning functions must return an iterable object.
it: le funzioni set-returning di PL/Python devono tornare un oggetto iterabile

source: error fetching next item from iterator
it: errore nell'ottenere l'elemento successivo dall'iteratore

source: PL/Python function with return type "void" did not return None
it: la funzione PL/Python con valore di ritorno "void" non ha restituito None

source: unexpected return value from trigger procedure
it: valore di ritorno inatteso dalla prodedura di trigger

source: Expected None or a string.
it: Atteso None o una stringa.

source: PL/Python trigger function returned "MODIFY" in a DELETE trigger -- ignored
it: la funzione PL/Python trigger ha restituito "MODIFY" in un trigger DELETE -- ignorato

source: Expected None, "OK", "SKIP", or "MODIFY".
it: Atteso None, "OK", "SKIP", o "MODIFY".

source: PyList_SetItem() failed, while setting up arguments
it: PyList_SetItem() è fallita durante l'impostazione degli argomenti

source: PyDict_SetItemString() failed, while setting up arguments
it: PyDict_SetItemString() è fallita durante l'impostazione degli argomenti

source: function returning record called in context that cannot accept type record
it: la funzione che restituisce un record è chiamata all'interno di un contesto che non può accettare il tipo record

source: while creating return value
it: durante la creazione del valore di ritorno

source: could not create new dictionary while building trigger arguments
it: impossibile creare un nuovo dizionario mentre si stanno costruendo gli argomenti del trigger

source: TD["new"] deleted, cannot modify row
it: TD["new"] cancellato, impossibile modificare la riga

source: TD["new"] is not a dictionary
it: TD["new"] non è un dizionario

source: TD["new"] dictionary key at ordinal position %d is not a string
it: la chiave di dizionario TD["new"] alla posizione %d non è una stringa

source: key "%s" found in TD["new"] does not exist as a column in the triggering row
it: la chiave "%s" trovata in TD["new"] non esiste come colonna nella riga del trigger

source: while modifying trigger row
it: durante la modifica della riga trigger

source: untrapped error in initialization
it: errore non catturato durante l'inizializzazione

source: could not import "__main__" module
it: impossibile importare il modulo "__main__"

source: could not initialize globals
it: impossibile inizializzare le variabili globali

source: PL/Python function "%s"
it: funzione PL/Python "%s"

source: PL/Python anonymous code block
it: codice di blocco anonimo in PL/Python

source: plan.status takes no arguments
it: plan.status non accetta argomenti

source: could not parse error message in plpy.elog
it: impossibile interpretare il messaggio di errore in plpy.elog

source: trigger functions can only be called as triggers
it: le funzioni trigger possono essere chiamate solo come trigger

source: PL/Python functions cannot return type %s
it: le funzioni PL/Python non possono tornare il tipo %s

source: PL/Python functions cannot accept type %s
it: le funzioni PL/Python non possono accettare il tipo %s

source: could not compile PL/Python function "%s"
it: impossibile compilare la funzione PL/Python "%s"

source: second argument of plpy.prepare must be a sequence
it: il secondo argomento di plpy.prepare deve essere una sequenza

source: plpy.prepare: type name at ordinal position %d is not a string
it: plpy.prepare: il nome del tipo nella posizione %d non è una stringa

source: plpy.prepare does not support composite types
it: plpy.prepare non supporta tipi composti

source: plpy.execute expected a query or a plan
it: plpy.execute si aspetta una query o un plan

source: plpy.execute takes a sequence as its second argument
it: plpy.execute richiede una sequenza come secondo argomento

source: SPI_execute_plan failed: %s
it: SPI_execute_plan ha fallito: %s

source: SPI_execute failed: %s
it: SPI_execute ha fallito: %s

source: unrecognized error in PLy_spi_execute_fetch_result
it: errore non riconosciuto nella funzione PLy_spi_execute_fetch_result

source: could not create new dictionary
it: impossibile creare il nuovo dizionario

source: could not create bytes representation of Python object
it: impossibile creare la rappresentazione di tipo byte dell'oggetto Python

source: could not create string representation of Python object
it: impossibile creare la rappresentazione di tipo stringa dell'oggetto Python

source: key "%s" not found in mapping
it: la chiave "%s" non è stata trovata nel dizionario

source: To return null in a column, add the value None to the mapping with the key named after the column.
it: Per ritornare null in una colonna, inserire nella mappa il valore None in corrispondenza del nome di colonna come chiave.

source: length of returned sequence did not match number of columns in row
it: la lunghezza della sequenza ritornata non rispetta il numero di colonne presenti nella riga

source: attribute "%s" does not exist in Python object
it: l'attributo "%s" non esiste nell'oggetto Python

source: To return null in a column, let the returned object have an attribute named after column with value None.
it: Per ritornare null in una colonna, assicurarsi che all'oggetto di ritorno corrisponda nel dizionario un attributo con valore None.
